; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v5 ?v12)
             (pred_12 ?v1 ?v7)
             (pred_6 ?v5 ?v7)
             (pred_1 ?v10 ?v5 )
	     (pred_10 ?v5)
             (pred_7 ?v11)
             (pred_3 ?v1)
             (pred_5 ?v7)
             (pred_11 ?v5)
             (pred_4 ?v1)
             (pred_2 ?v5)
             (pred_9 ))



(:action op_1
:parameters (?v6 ?v3 ?v2 ?v13)
:precondition (and (pred_7 ?v6) (pred_7 ?v3) (pred_3 ?v2) (pred_5 ?v13)
          (pred_8 ?v6 ?v3) (pred_12 ?v2 ?v13)
                   (pred_6 ?v3 ?v13) (pred_10 ?v6) 
                   (pred_11 ?v3) (pred_4 ?v2))
:effect (and  (pred_2 ?v3) (not (pred_11 ?v3))))


(:action op_3
:parameters (?v6 ?v4)
:precondition (and (pred_7 ?v6) (pred_7 ?v4)
               (pred_10 ?v6) (pred_8 ?v6 ?v4) (pred_2 ?v4))
:effect (and (pred_10 ?v4) (not (pred_10 ?v6))))

(:action op_5
:parameters (?v6 ?v2)
:precondition (and (pred_7 ?v6) (pred_3 ?v2) 
                  (pred_10 ?v6) (pred_1 ?v2 ?v6) (pred_9 ))
:effect (and (pred_4 ?v2)
   (not (pred_1 ?v2 ?v6)) (not (pred_9 ))))


(:action op_4
:parameters (?v6 ?v9 ?v8)
:precondition (and (pred_7 ?v6) (pred_3 ?v9) (pred_3 ?v8)
                  (pred_10 ?v6) (pred_4 ?v8) (pred_1 ?v9 ?v6))
:effect (and (pred_4 ?v9) (pred_1 ?v8 ?v6)
        (not (pred_4 ?v8)) (not (pred_1 ?v9 ?v6))))

(:action op_2
:parameters (?v6 ?v2)
:precondition (and (pred_7 ?v6) (pred_3 ?v2) 
                  (pred_10 ?v6) (pred_4 ?v2))
:effect (and (pred_9 ) (pred_1 ?v2 ?v6) (not (pred_4 ?v2)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_09 obj_10 obj_07 obj_01 obj_02 obj_13 obj_11 obj_05 obj_03
    obj_04 obj_12
    obj_06 obj_08
    )

    (:init
       (pred_9)

       (pred_7 obj_09)
       (pred_7 obj_10)
       (pred_7 obj_07)
       (pred_7 obj_01)
       (pred_7 obj_02)
       (pred_7 obj_13)
       (pred_7 obj_11)
       (pred_7 obj_05)
       (pred_7 obj_03)
       (pred_5 obj_04)
       (pred_5 obj_12)
       (pred_3 obj_06)
       (pred_3 obj_08)

       (pred_8 obj_09 obj_01)
       (pred_8 obj_09 obj_10)
       (pred_8 obj_10 obj_02)
       (pred_8 obj_10 obj_07)
       (pred_8 obj_10 obj_09)
       (pred_8 obj_07 obj_13)
       (pred_8 obj_07 obj_10)
       (pred_8 obj_01 obj_11)
       (pred_8 obj_01 obj_02)
       (pred_8 obj_01 obj_09)
       (pred_8 obj_02 obj_05)
       (pred_8 obj_02 obj_13)
       (pred_8 obj_02 obj_10)
       (pred_8 obj_02 obj_01)
       (pred_8 obj_13 obj_03)
       (pred_8 obj_13 obj_07)
       (pred_8 obj_13 obj_02)
       (pred_8 obj_11 obj_05)
       (pred_8 obj_11 obj_01)
       (pred_8 obj_05 obj_03)
       (pred_8 obj_05 obj_02)
       (pred_8 obj_05 obj_11)
       (pred_8 obj_03 obj_13)
       (pred_8 obj_03 obj_05)
       (pred_11 obj_11)
       (pred_11 obj_03)
       (pred_6  obj_11 obj_04)
       (pred_6  obj_03 obj_12)
       (pred_2 obj_09)
       (pred_2 obj_10)
       (pred_2 obj_07)
       (pred_2 obj_01)
       (pred_2 obj_02)
       (pred_2 obj_13)
       (pred_2 obj_05)

       (pred_12  obj_06 obj_04)
       (pred_12  obj_08 obj_12)
       (pred_1 obj_06 obj_07)
       (pred_1 obj_08 obj_07)
       (pred_10 obj_01)
    )

    (:goal (and
       (pred_1 obj_08 obj_01)
    ))
(:constraints
  (always (not (pred_10 obj_10)))
)
)

; plan
1. (op_3 obj_01 obj_02)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_02)
   goals met: 0 of 1
2. (op_3 obj_02 obj_13)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_13)
   goals met: 0 of 1
3. (op_3 obj_13 obj_07)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_07)
   goals met: 0 of 1
4. (op_5 obj_07 obj_08)
   deleted: (pred_1 obj_08 obj_07) (pred_9)
   added: (pred_4 obj_08)
   goals met: 0 of 1
5. (op_3 obj_07 obj_13)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_13)
   goals met: 0 of 1
6. (op_3 obj_13 obj_02)
   deleted: (pred_10 obj_13)
   added: (pred_10 obj_02)
   goals met: 0 of 1
7. (op_3 obj_02 obj_01)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_01)
   goals met: 0 of 1
8. (op_2 obj_01 obj_08)
   deleted: (pred_4 obj_08)
   added: (pred_9) (pred_1 obj_08 obj_01)
   goals met: 1 of 1
